// デバイスクラス

#pragma once

#include "Dx12.h"
#include <d3d12.h>

//---------------------------------------------------------------------------------
/**
 * @brief	デバイスクラス
 */
class Device final {
public:
    //---------------------------------------------------------------------------------
    /**
     * @brief    コンストラクタ
     */
    Device() = default;

    //---------------------------------------------------------------------------------
    /**
     * @brief    デストラクタ
     */
    ~Device();

    //---------------------------------------------------------------------------------
    /**
     * @brief	デバイスを作成する
	 * @param	dxgi	DXGI クラスのインスタンス
     * @return	作成出来た場合は true
     */
    [[nodiscard]] bool create(const Dx12& dxgi) noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	デバイスを取得する
     * @return	dx12 デバイスのポインタ
     */
    [[nodiscard]] ID3D12Device* get() const noexcept;


private:
    ID3D12Device* device_;  /// デバイス
};
