// DXGI 制御クラス

#pragma once

#include <d3d12.h>
#include <dxgi1_4.h>

//---------------------------------------------------------------------------------
/**
 * @brief	DXGI 制御クラス
 */
class DXGI final {
public:
    //---------------------------------------------------------------------------------
    /**
     * @brief    コンストラクタ
     */
    DXGI() = default;

    //---------------------------------------------------------------------------------
    /**
     * @brief    デストラクタ
     */
    ~DXGI();

    //---------------------------------------------------------------------------------
    /**
     * @brief	ディスプレイアダプタの設定
     * @return	ディスプレイの情報が正しく取得できた場合は true
     */
    [[nodiscard]] bool setDisplayAdapter() noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	dxgi ファクトリーを取得する
     * @return	dxgi ファクトリーのポインタ
     */
    [[nodiscard]] IDXGIFactory4* factory() const noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	ディスプレイアダプターを取得する
     * @return	ディスプレイアダプターのポインタ
     */
    [[nodiscard]] IDXGIAdapter1* displayAdapter() const noexcept;

private:
    IDXGIFactory4* dxgiFactory_{};  /// DXGIを作成するファクトリー
    IDXGIAdapter1* dxgiAdapter_{};  /// ディスプレイモード取得用アダプタ
};
