// フェンス（CPUとGPUの動機）制御クラス

#pragma once

#include "device.h"

//---------------------------------------------------------------------------------
/**
 * @brief	フェンス（CPUとGPUの動機）制御クラス
 */
class Fence final {
public:
    //---------------------------------------------------------------------------------
    /**
     * @brief    コンストラクタ
     */
    Fence() = default;

    //---------------------------------------------------------------------------------
    /**
     * @brief    デストラクタ
     */
    ~Fence();

    //---------------------------------------------------------------------------------
    /**
     * @brief	フェンスを作成する
     */
    [[nodiscard]] bool create(const Device& device) noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	同期待ちを行う
     * @param fenceValue	フェンス値
     */
    void wait(UINT64 fenceValue) const noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	フェンスを取得する
     */
    [[nodiscard]] ID3D12Fence* get() const noexcept;


private:
    ID3D12Fence* fence_{};         /// フェンス
    HANDLE       waitGpuEvent_{};  /// GPU と CPU 同期用のイベントハンドル
};
